# Bakery Sales Data Analysis

## Team Members (Raum#5)
- Awais (Repo + Codespace + jupyter playbook setup)
- Jerry (Visualization) 
- Paida (merge dataframes) @PaidaHazel
- Yousra (Descriptive Statics) @yousra-Abdrabou
## Plan
- [x] Read All 3 csv
- [ ] Check for Quality (skip it)
- [ ] Merge DataFrames
- [ ] Descriptive Statics

- Visualize (Use the output of above step)
 

## Import Required Libraries

In [15]:
import pandas as pd
import numpy as np

# Load Data Files

## 1. Kiwo Dataset

In [16]:
df_kiwo = pd.read_csv('data/kiwo.csv')
print(f"Shape: {df_kiwo.shape}")
print(f"\nColumns: {list(df_kiwo.columns)}")
df_kiwo.head()

Shape: (72, 2)

Columns: ['Datum', 'KielerWoche']

        Datum  KielerWoche
0  2012-06-16            1
1  2012-06-17            1
2  2012-06-18            1
3  2012-06-19            1
4  2012-06-20            1

In [17]:
df_kiwo.describe()

       KielerWoche
count         72.0
mean           1.0
std            0.0
min            1.0
25%            1.0
50%            1.0
75%            1.0
max            1.0

## 2. Sales Data (Umsatzdaten)

In [18]:
df_sales = pd.read_csv('data/Umsatzdaten _gekuerzt.csv')
print(f"Shape: {df_sales.shape}")
print(f"\nColumns: {list(df_sales.columns)}")
df_sales.head()

Shape: (9334, 4)

Columns: ['id', 'Datum', 'Warengruppe', 'Umsatz']

        id       Datum  Warengruppe      Umsatz
0  1307011  2013-07-01            1  148.828353
1  1307021  2013-07-02            1  159.793757
2  1307031  2013-07-03            1  111.885594
3  1307041  2013-07-04            1  168.864941
4  1307051  2013-07-05            1  171.280754

In [19]:
df_sales.describe()

                 id  Warengruppe       Umsatz
count  9.334000e+03  9334.000000  9334.000000
mean   1.559311e+06     3.088172   206.749044
std    1.512503e+05     1.489002   144.545189
min    1.307011e+06     1.000000     7.051201
25%    1.410123e+06     2.000000    96.897441
50%    1.601102e+06     3.000000   161.900831
75%    1.704223e+06     4.000000   280.644663
max    1.807315e+06     6.000000  1879.461831

## 3. Weather Data (Wetter)

In [20]:
df_weather = pd.read_csv('data/wetter.csv')
print(f"Shape: {df_weather.shape}")
print(f"\nColumns: {list(df_weather.columns)}")
df_weather.head()

Shape: (2601, 5)

Columns: ['Datum', 'Bewoelkung', 'Temperatur', 'Windgeschwindigkeit', 'Wettercode']

        Datum  Bewoelkung  Temperatur  Windgeschwindigkeit  Wettercode
0  2012-01-01         8.0      9.8250                   14        58.0
1  2012-01-02         7.0      7.4375                   12         NaN
2  2012-01-03         8.0      5.5375                   18        63.0
3  2012-01-04         4.0      5.6875                   19        80.0
4  2012-01-05         6.0      5.3000                   23        80.0

In [21]:
df_weather.describe()

        Bewoelkung   Temperatur  Windgeschwindigkeit   Wettercode
count  2591.000000  2601.000000          2601.000000  1932.000000
mean      4.805866    12.099586            11.191080    37.484472
std       2.578299     7.174357             4.124693    27.567144
min       0.000000   -10.250000             3.000000     0.000000
25%       3.000000     6.512500             8.000000    10.000000
50%       6.000000    12.000000            10.000000    28.000000
75%       7.000000    17.825000            14.000000    61.000000
max       8.000000    32.671428            35.000000    95.000000

# Merge Dataframes
## Step 1
 // todo